app/views/cds/show.html.erb

<h2>Tracks</h2>
<% @cd.tracks.each do |track| %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."cd_id" = 1