app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
  		  <article class="dotted">
    		  <h3 style="color:#400205"><%= event.dateofevent.strftime("%A, %B %dnd, %Y") %> <%= event.timeofevent.strftime("%I") %><% if event.timeofevent.min != 0%><%= event.timeofevent.strftime(":%M") %><% end %><%= event.timeofevent.strftime("%p") %></h4>