app/views/pages/audio.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."cd_id" = 1
---

		<% cd.tracks.each do |track| %>