app/controllers/bios_controller.rb

SELECT "bios".* FROM "bios"
---
  def index
    @bios = Bio.all

SELECT "bios".* FROM "bios" WHERE "bios"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @bio = Bio.find(params[:id])

SELECT "bios".* FROM "bios" WHERE "bios"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @bio = Bio.find(params[:id])

INSERT INTO "bios" ("content", "created_at", "imagename", "name", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @bio = Bio.new(params[:bio])

    respond_to do |format|
      if @bio.save

SELECT "bios".* FROM "bios" WHERE "bios"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "bios" SET "name" = 'Daphna Mor: Recorders, Nays', "content" = 'Hailed as a ‘Recorder virtuoso’ by the NY Times, Daphna Mor has performed throughout Europe The United States and Canada as a soloist and as an ensemble player. Her appearances include the most prestigious Classical Music stages – performing as a soloist in Carnegie Hall and as an orchestra member with the New York Philharmonic in Lincoln Center in New York, as well as acclaimed world music venues as Summer Stage, Central Park. NY.
---
  def update
    @bio = Bio.find(params[:id])

    respond_to do |format|
      if @bio.update_attributes(params[:bio])