app/controllers/events_controller.rb

INSERT INTO "events" ("address", "content", "created_at", "dateofevent", "timeofevent", "title", "townstate", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "content" = '$15.5 includes 3pm concert, 2pm workshop and a beverage! ', "updated_at" = '2011-12-31 02:31:20.862517' WHERE "events"."id" = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])