app/controllers/home_controller.rb

SELECT "news".* FROM "news" LIMIT 3
SELECT "events".* FROM "events" LIMIT 3
---
  def index
    @news = News.limit(3).sort_by(&:date).reverse
    @events = Event.limit(3).sort_by(&:dateofevent).reverse