app/controllers/news_controller.rb

SELECT "news".* FROM "news"
---
  def index
    @news = News.all

SELECT "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @news = News.find(params[:id])

INSERT INTO "news" ("content", "created_at", "date", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @news = News.new(params[:news])

    respond_to do |format|
      if @news.save