app/controllers/presses_controller.rb

SELECT "presses".* FROM "presses"
---
  def index
    @presses = Press.all

SELECT "presses".* FROM "presses" WHERE "presses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @press = Press.find(params[:id])

SELECT "presses".* FROM "presses" WHERE "presses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @press = Press.find(params[:id])

INSERT INTO "presses" ("content", "created_at", "location", "readmoreurl", "reviewer", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @press = Press.new(params[:press])

    respond_to do |format|
      if @press.save

SELECT "presses".* FROM "presses" WHERE "presses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @press = Press.find(params[:id])