app/controllers/tracks_controller.rb

  def create
    @cd = Cd.find(params[:cd_id])
    @track = @cd.tracks.create(params[:track])
---
INSERT INTO "tracks" ("cd_id", "created_at", "name", "order_number", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cd_id", 1], ["created_at", Fri, 06 Jan 2012 17:21:01 UTC +00:00], ["name", "Ala Ouhida"], ["order_number", 1], ["updated_at", Fri, 06 Jan 2012 17:21:01 UTC +00:00]]