app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 05 Jan 2012 22:44:00 UTC +00:00], ["email", "Bla"], ["name", "Bla"], ["updated_at", Thu, 05 Jan 2012 22:44:00 UTC +00:00]]

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "users" SET "name" = 'hjlkj', "email" = ';lk;;k', "updated_at" = '2012-01-06 18:41:18.088840' WHERE "users"."id" = 4